export const stepParams = {
  2: 'type',
  3: 'era',
  4: 'maturity',
  5: 'weight',
  6: 'personality',
  7: 'definition',
  8: 'concept',
}

export const paramNames = {
  type: 'Тип шрифта',
  era: 'Классический или современный',
  maturity: 'Зрелый или свежий',
  weight: 'Толстый или тонкий',
  personality: 'Игривый или элегантный',
  definition: 'Органический или геометрический',
  concept: 'Абстрактный или буквальный'
}

export const paramVariants = {
  type: ['serif', 'sans-serif', 'cursive'],
  era: [0, 0.5, 1],
  maturity: [0, 0.5, 1],
  weight: [0, 0.5, 1],
  personality: [0, 0.5, 1],
  definition: [0, 0.5, 1],
  concept: [0, 0.5, 1]
}

export const paramVariantDescriptions = {
  type: [
    'Serif: Серьезный, Классический, Традиционный & Солидный',
    'Sans-Serif: Универсальный, Дружелюбный & Нейтральный',
    'Handwriting: Серьезный, Классический, Традиционный & Солидный',
  ],
  era: [
    'Старой эпохи: Изысканный Серьезный & Элегантный',
    'Из двух миров: Доступный, Нейтральный & Дружелюбный',
    'Современный: Молодой, Энергичный & Веселый'
  ],
  maturity: [
    'Зрелое начертание: Изысканный Серьезный & Элегантный',
    'Современное начертание: Нейтральный, Скромный & Дружелюбный',
    'Свежее начертание: Энергичный, Молодой & Веселый'
  ],
  weight: [
    'Тонкий: Элегантный, Мягкий & Скромный',
    'Средний: Нейтральный, Дружелюбный & Надежный',
    'Жирный: Уверенный, Энергичный & Твердый'
  ],
  personality: [
    'Игривый: Энергичный, Дружелюбный & Позитивный',
    'Из двух миров: Доступный, Нейтральный & Дружелюбный',
    'Элегантный: Изысканный, Зрелый & Утонченный'
  ],
  definition: [
    'Органический: Мрачный, Креативный & Нейтральный',
    'Из двух миров: Доступный, Нейтральный & Дружелюбный',
    'Геометрический: Простой, Прямолинейный & Уверенный'
  ],
  concept: [
    'Нетрадиционная гарнитура: Яркий, Концептуальный & Креативный',
    'Веселая гарнитура: Энергичный, Дружелюбный & Позитивный',
    'Обычная гарнитура: Нейтральный, Надержный & Сдержанный'
  ]
}


// type
// era
// maturity
// weight
// personality
// definition
// concept
